benchmark/logs/longhorn-nfs.log
root@k8s-node1:~/benchmark/longhorn# k logs -f longhorn-nfs-dbench-job-rc7cw 
Working dir: /tmp

Testing Read IOPS...
fio: posix_fallocate fails: Not supported
read_iops: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process
read_iops: Laying out IO file(s) (1 file(s) / 2048MiB)

read_iops: (groupid=0, jobs=1): err= 0: pid=11: Fri May  5 08:52:01 2023
   read: IOPS=23.4k, BW=91.2MiB/s (95.6MB/s)(1368MiB/15001msec)
  cpu          : usr=1.96%, sys=8.20%, ctx=258747, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=113.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=350042,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=91.2MiB/s (95.6MB/s), 91.2MiB/s-91.2MiB/s (95.6MB/s-95.6MB/s), io=1368MiB (1434MB), run=15001-15001msec


Testing Write IOPS...
write_iops: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_iops: (groupid=0, jobs=1): err= 0: pid=21: Fri May  5 08:52:18 2023
  write: IOPS=2059, BW=8256KiB/s (8454kB/s)(121MiB/15019msec)
  cpu          : usr=0.33%, sys=0.89%, ctx=30117, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=117.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,30935,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=8256KiB/s (8454kB/s), 8256KiB/s-8256KiB/s (8454kB/s-8454kB/s), io=121MiB (127MB), run=15019-15019msec


Testing Read Bandwidth...
read_bw: (g=0): rw=randread, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

read_bw: (groupid=0, jobs=1): err= 0: pid=31: Fri May  5 08:52:36 2023
   read: IOPS=11.1k, BW=1493MiB/s (1565MB/s)(21.9GiB/15006msec)
  cpu          : usr=1.39%, sys=15.52%, ctx=178571, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=112.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=179159,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1493MiB/s (1565MB/s), 1493MiB/s-1493MiB/s (1565MB/s-1565MB/s), io=21.9GiB (23.5GB), run=15006-15006msec


Testing Write Bandwidth...
write_bw: (g=0): rw=randwrite, bs=128KiB-128KiB,128KiB-128KiB,128KiB-128KiB, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

write_bw: (groupid=0, jobs=1): err= 0: pid=41: Fri May  5 08:52:53 2023
  write: IOPS=1099, BW=138MiB/s (145MB/s)(2074MiB/15032msec)
  cpu          : usr=1.28%, sys=1.34%, ctx=19166, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=112.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,16528,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=138MiB/s (145MB/s), 138MiB/s-138MiB/s (145MB/s-145MB/s), io=2074MiB (2175MB), run=15032-15032msec


Testing Read Latency...
read_latency: (g=0): rw=randread, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

read_latency: (groupid=0, jobs=1): err= 0: pid=51: Fri May  5 08:53:11 2023
   read: IOPS=33.3k, BW=130MiB/s (136MB/s)(1947MiB/15001msec)
    slat (usec): min=0, max=3432, avg= 2.17, stdev= 6.99
    clat (usec): min=10, max=16882, avg=117.75, stdev=153.27
     lat (usec): min=69, max=16884, avg=119.91, stdev=153.46
    clat percentiles (usec):
     |  1.00th=[   75],  5.00th=[   79], 10.00th=[   81], 20.00th=[   91],
     | 30.00th=[  101], 40.00th=[  108], 50.00th=[  112], 60.00th=[  117],
     | 70.00th=[  122], 80.00th=[  129], 90.00th=[  139], 95.00th=[  149],
     | 99.00th=[  195], 99.50th=[  306], 99.90th=[ 1512], 99.95th=[ 2736],
     | 99.99th=[ 7648]
    lat (usec) : 20=0.01%, 50=0.01%, 100=26.57%, 250=72.82%, 500=0.29%
    lat (usec) : 750=0.11%, 1000=0.05%
    lat (msec) : 2=0.09%, 4=0.04%, 10=0.03%, 20=0.01%
  cpu          : usr=3.95%, sys=9.49%, ctx=412710, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=113.3%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=498346,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=130MiB/s (136MB/s), 130MiB/s-130MiB/s (136MB/s-136MB/s), io=1947MiB (2041MB), run=15001-15001msec


Testing Write Latency...
write_latency: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=4
fio-2.17-45-g06cb
Starting 1 process

write_latency: (groupid=0, jobs=1): err= 0: pid=61: Fri May  5 08:53:28 2023
  write: IOPS=482, BW=1930KiB/s (1976kB/s)(28.3MiB/15011msec)
    slat (usec): min=1, max=1847, avg= 6.64, stdev=21.36
    clat (msec): min=7, max=21, avg= 8.28, stdev= 1.02
     lat (msec): min=7, max=21, avg= 8.29, stdev= 1.02
    clat percentiles (usec):
     |  1.00th=[ 7840],  5.00th=[ 7840], 10.00th=[ 7904], 20.00th=[ 7968],
     | 30.00th=[ 7968], 40.00th=[ 8032], 50.00th=[ 8096], 60.00th=[ 8096],
     | 70.00th=[ 8160], 80.00th=[ 8256], 90.00th=[ 8512], 95.00th=[ 9024],
     | 99.00th=[13760], 99.50th=[16064], 99.90th=[18560], 99.95th=[21376],
     | 99.99th=[21632]
    lat (msec) : 10=96.74%, 20=3.25%, 50=0.06%
  cpu          : usr=0.18%, sys=0.20%, ctx=6692, majf=0, minf=3
  IO depths    : 1=0.1%, 2=0.1%, 4=113.3%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,7240,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=1930KiB/s (1976kB/s), 1930KiB/s-1930KiB/s (1976kB/s-1976kB/s), io=28.3MiB (29.7MB), run=15011-15011msec


Testing Read Sequential Speed...
fio: posix_fallocate fails: Not supported
read_seq: (g=0): rw=read, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads
read_seq: Laying out IO file(s) (1 file(s) / 3548MiB)

read_seq: (groupid=0, jobs=1): err= 0: pid=71: Fri May  5 08:54:10 2023
   read: IOPS=250, BW=251MiB/s (263MB/s)(3793MiB/15097msec)
  cpu          : usr=0.02%, sys=1.76%, ctx=5749, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=106.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=3778,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=72: Fri May  5 08:54:10 2023
   read: IOPS=249, BW=250MiB/s (262MB/s)(3771MiB/15084msec)
  cpu          : usr=0.13%, sys=1.70%, ctx=5683, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=106.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=3756,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=73: Fri May  5 08:54:10 2023
   read: IOPS=248, BW=249MiB/s (261MB/s)(3764MiB/15095msec)
  cpu          : usr=0.15%, sys=1.61%, ctx=5729, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=107.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=3749,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
read_seq: (groupid=0, jobs=1): err= 0: pid=74: Fri May  5 08:54:10 2023
   read: IOPS=246, BW=247MiB/s (259MB/s)(3722MiB/15040msec)
  cpu          : usr=0.15%, sys=1.62%, ctx=5544, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=106.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=3707,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=997MiB/s (1045MB/s), 247MiB/s-251MiB/s (259MB/s-263MB/s), io=14.8GiB (15.8GB), run=15040-15097msec


Testing Write Sequential Speed...
write_seq: (g=0): rw=write, bs=1024KiB-1024KiB,1024KiB-1024KiB,1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-2.17-45-g06cb
Starting 4 threads

write_seq: (groupid=0, jobs=1): err= 0: pid=84: Fri May  5 08:54:29 2023
  write: IOPS=35, BW=36.6MiB/s (38.3MB/s)(596MiB/16332msec)
  cpu          : usr=0.40%, sys=0.31%, ctx=718, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.4%, 16=118.2%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,581,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=85: Fri May  5 08:54:29 2023
  write: IOPS=35, BW=36.8MiB/s (38.6MB/s)(600MiB/16313msec)
  cpu          : usr=0.58%, sys=0.11%, ctx=669, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.4%, 16=117.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,585,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=86: Fri May  5 08:54:29 2023
  write: IOPS=36, BW=37.9MiB/s (39.7MB/s)(606MiB/16031msec)
  cpu          : usr=0.41%, sys=0.30%, ctx=586, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.4%, 16=116.2%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,591,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
write_seq: (groupid=0, jobs=1): err= 0: pid=87: Fri May  5 08:54:29 2023
  write: IOPS=36, BW=37.5MiB/s (39.3MB/s)(611MiB/16309msec)
  cpu          : usr=0.37%, sys=0.36%, ctx=781, majf=0, minf=0
  IO depths    : 1=0.2%, 2=0.3%, 4=0.7%, 8=1.3%, 16=115.3%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,596,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=148MiB/s (155MB/s), 36.6MiB/s-37.9MiB/s (38.3MB/s-39.7MB/s), io=2413MiB (2530MB), run=16031-16332msec


Testing Read/Write Mixed...
rw_mix: (g=0): rw=randrw, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=64
fio-2.17-45-g06cb
Starting 1 process

rw_mix: (groupid=0, jobs=1): err= 0: pid=97: Fri May  5 08:54:46 2023
   read: IOPS=6128, BW=23.1MiB/s (25.2MB/s)(360MiB/15017msec)
  write: IOPS=2059, BW=8251KiB/s (8449kB/s)(121MiB/15017msec)
  cpu          : usr=0.87%, sys=3.25%, ctx=123318, majf=0, minf=1
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=115.4%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=92028,30935,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=23.1MiB/s (25.2MB/s), 23.1MiB/s-23.1MiB/s (25.2MB/s-25.2MB/s), io=360MiB (377MB), run=15017-15017msec
  WRITE: bw=8251KiB/s (8449kB/s), 8251KiB/s-8251KiB/s (8449kB/s-8449kB/s), io=121MiB (127MB), run=15017-15017msec


All tests complete.

==================
= Dbench Summary =
==================
Random Read/Write IOPS: 23.4k/2059. BW: 1493MiB/s / 138MiB/s
Average Latency (usec) Read/Write: 119.91/
Sequential Read/Write: 997MiB/s / 148MiB/s
Mixed Random Read/Write IOPS: 6128/2059